In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
   'name':['george','pranjal','mayank','rajjwal','divya'],
   'marks':[99,95,98,96,84],
   'city':['prayahraj','mirzapur','allapur','daraganj','daraganj']
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df.head()

      name  marks       city
0   george     99  prayahraj
1  pranjal     95   mirzapur
2   mayank     98    allapur
3  rajjwal     96   daraganj
4    divya     84   daraganj

In [6]:
df.head(2)

      name  marks       city
0   george     99  prayahraj
1  pranjal     95   mirzapur

In [7]:
df.to_csv("first.csv")

In [8]:
df.to_csv('second.csv', index = False)

In [9]:
df.tail(2)

      name  marks      city
3  rajjwal     96  daraganj
4    divya     84  daraganj

In [10]:
df.describe()

           marks
count   5.000000
mean   94.400000
std     6.024948
min    84.000000
25%    95.000000
50%    96.000000
75%    98.000000
max    99.000000

In [14]:
train = pd.read_csv("train.csv")

In [15]:
train

   train_no.  speed       city
0      12792     23  prayahraj
1      12342    343   mirzapur
2      23442     43    allapur
3      34323    433   daraganj
4      23442     86   daraganj

In [19]:
train["speed"]

0     23
1    343
2     43
3    433
4     86
Name: speed, dtype: int64

In [20]:
train["speed"][0]

23

In [31]:
train['speed'][0]=100

C:\Users\georg\AppData\Local\Temp\ipykernel_760\2570865288.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['speed'][0]=100

In [32]:
train

   train_no.  speed       city
0      12792    100  prayahraj
1      12342    343   mirzapur
2      23442     43    allapur
3      34323    433   daraganj
4      23442     86   daraganj

In [34]:
train.to_csv("csv2.csv")

In [35]:
train.to_csv('csv2.csv',index=False)

In [37]:
train.index=['one','two','three','four','five']

In [38]:
train

       train_no.  speed       city
one        12792    100  prayahraj
two        12342    343   mirzapur
three      23442     43    allapur
four       34323    433   daraganj
five       23442     86   daraganj